{
  "data": [
    {
      "id": 9,
      "blogCategory": "News",
      "blogTitle": "F. Scott Fitzgerald dies (again) from ASR Covid variant",
      "slug": "",
      "postedOn": "2022-03-18",
      "author": "Marecchia Staff",
      "blogImage": "https://raw.githubusercontent.com/henryburkhardt/marecchia/master/src/data/images/fscottDeath2.jpg",
      "imageCredit": "",
      "blogText": "The Marecchia staff is deeply saddened to announce the premature re-death of recently resurrected alumni F. Scott Fitzgerald. Earlier this morning Marrechia staff were informed that Fitzgerald had come in close contact with vials containing the previously covered ASR Covid variant, and became infected shortly after. The virus has since been contained but Fitzgerald, unfortunately, experienced an extremely severe case. SPA’s invaluable in-house epidemiologist provided scientific insight, noting that “his record-breaking age of 126 years may have contributed to his extreme symptoms and untimely passing.” Shortly after his death, students also learned Fitzgerald was completely unvaccinated due to his incredibly short (second) life span. The Marrechia’s thoughts and prayers go out to the Human Physiology class and loyal fans of Fitzgerald. A vigil will be held next week where members of the English department will participate in an all-night simultaneous out-loud reading of the Great Gatsby. The service will be held off SPA property, due to his disciplinary status of “formally expelled.” The Human Physiology elective faculty are currently looking into the possibility of resurrecting Fitzgerald a second time. "
    },
    {
      "id": 8,
      "blogCategory": "News",
      "blogTitle": "March Mammal Madness no longer a simulation",
      "slug": "",
      "postedOn": "2022-03-10",
      "author": "F. Scott Fitzgerald",
      "blogImage": "https://i.dailymail.co.uk/1s/2020/05/14/09/28379222-8318755-image-a-37_1589444731214.jpg",
      "imageCredit": "Image Credit: Daily Mail",
      "blogText": "An anonymous 9th grader told the Marecchia she was confused when she noticed her own name on the March Mammal Madness bracket earlier today. She reached out to the biology teachers coordinating the competition (which has historically been a pen-and-paper simulation of animal fights) with her concerns. In an email from the department, the head coordinator wrote that “this year the bracketed competition will include mandatory real-life participation from both students and non-human mammals.” The first round of fights will take place in the Lilly Courtyard next Wednesday during advisory. The biology department has notified students that they are not responsible for any serious injury or loss of life that results from this good-spirited competition. "
    },
    {
      "id": 7,
      "blogCategory": "News",
      "blogTitle": "SPA to hold Weezer concert next month",
      "slug": "",
      "postedOn": "2022-03-09",
      "author": "F. Scott Fitzgerald",
      "blogImage": "https://images.nintendolife.com/e0f66909e4cc5/1280x720.jpg",
      "imageCredit": "Image Credit: https://www.nintendolife.com/",
      "blogText": "To build hype for the upcoming prom, SAC announced another spirit week, the climax of which will be a Weezer concert in Huss. One student the Marecchia spoke to said, “nobody likes Weezer. I hate Weezer. Nobody listens to them.” While student reactions may be mixed, the concert will still have an academic benefit. The Ancient World History elective will be attending the concert to “learn about one of the darkest periods in modern music history.”  Upon hearing the news of the concert, one misguided student said to the Marecchia “Oh cool, I like Weezer.” The Marecchia staff has reached out to the health office to provide counseling for the student. Mike Pence, who will be visiting campus later this week, declined Weezers offer to join the performance citing his previously scheduled task hand counting every vote cast in the state of Georgia."
    },
    {
      "id": 6,
      "blogCategory": "News",
      "blogTitle": "Human physiology elective resurrects F. Scott Fitzgerald",
      "slug": "",
      "postedOn": "2022-03-09",
      "author": "Marecchia Staff",
      "blogImage": "https://longreadsblog.files.wordpress.com/2017/03/fitz.jpg",
      "imageCredit": "Image Credit (https://longreads.com/)",
      "blogText": "The SPA science department announced earlier this week that the semester-long project of bringing back SPA alumn F. Scott Fitzgerald from the dead has been successfully completed. While some concerns have been raised about the societal implications of returning humans from the dead, the department maintains that it’s, “a great intro to the human body, and life sciences.” Unfortunately, Fitzgerald was expelled from SPA in the early 1900s, so following school policy, the administration has announced that he will not be allowed to pursue his studies on campus. The school is currently looking for a host family for Fitzgerald. The Marrechia was unable to reach him for comment but school staff has informed us he’s currently residing in the Huss theater catwalk. He will be providing free essay revisions in the learning center from 2-5am during full moons."
    },
    {
      "id": 5,
      "blogCategory": "Finance",
      "blogTitle": "SPA acquires Blake in record-breaking merger",
      "slug": "",
      "postedOn": "2022-03-06",
      "author": "Marecchia Staff",
      "blogImage": "https://images1.privateschoolreview.com/photo/1122x864/15000/14821/the-blake-school-upper-school-fvEDQX.jpg",
      "imageCredit": "Image Credit: Private School Review",
      "blogText": "On Monday, the business office officially announced to investors that the long-awaited acquisition of the Blake School of Excellence has been officially approved by the Securities and Exchange Commission. Investors and SEC officials alike were confused because, as one SEC spokeswoman said, “Blake is literally worthless as an asset,” but the business office maintains that the land that the school occupies will be put to good use as an additional Sophomore-only parking lot. The Marecchia will also be relocating its headquarters to the new satellite campus, to increase its distance from the office of the Dean of Students. Insider sources have confirmed SPA intends to acquire Breck sometime late next month. "
    },
    {
      "id": 4,
      "blogCategory": "News",
      "blogTitle": "Going Viral: ASR student creates new COVID-19 variant",
      "slug": "",
      "postedOn": "2022-03-04",
      "author": "Marecchia Staff",
      "blogImage": "https://dailymontanan.com/wp-content/uploads/2021/07/1624849193_B7nBOQ_COVID_19.jpg",
      "imageCredit": "Daily Montanan, Creative Commons Licesne",
      "blogText": "Last Tuesday, a student in the Advanced Science Research course unveiled her successful mutation of the COVID-19 virus. Her faculty advisor told the Marecchia that while ASR is, “normally not a space where we encourage the mutation of potentially deadly viruses,” the results were, “quite frankly pretty impressive for a high school student.” A senior member of the administration added that, “this might be one of the greatest achievements in SPA history, second only to the creation of our very own esteemed publication the Marecchia.” The student (who asked to remain anonymous) was named an ISEF finalist. She will travel to Geneva later this month to present her findings and also attend her bioterrorism hearing at the United Nations. The Merrechia does not support the creation or distribution of COVID-19 variants."
    },
    {
      "id": 1,
      "blogCategory": "Opinion",
      "blogTitle": "Trough Feeding: The future of SPA lunch",
      "slug": "",
      "postedOn": "March 1, 2022",
      "author": "Marecchia Staff",
      "blogImage": "https://bringmethenews.com/.image/t_share/MTg0MDc2MzQ3MzYwOTQ2MDUx/school-lunch-cafeteria-flickr.jpg",
      "imageCredit": "Creative Commons, Fair Use Image",
      "blogText": "In recent weeks frustration about long lunch lines \n has grown among the student body, but few solutions have been proposed. This year, the addition of a second lunch line was good in theory but has done little to ease long waiting times. In times like these, drastic actions must sometimes be taken. One solution recently proposed is the Trough Feeding System. The Marecchia spoke to the student (who preferred to remain anonymous) who made the idea and he explained it simply as a “revolutionary liquid-based community-style feeding solution, where each lunch would be liquified in a blender and then poured into large communal style troughs.” He added that “straws would, of course, be provided to each student.” While the idea has faced some pushback because of how it treats children like farm animals, the anonymous founder noted that this might be outweighed by the fact that, “the entire school could literally eat lunch in the span of 10 minutes.” The idea also has the advantage of treating all students equally (everyone would get the same time in the trough, and the same diameter straw). This is especially refreshing after the recent propagation of ideas like the GPA-based food system and the Underclassmen Just Don’t Get Lunch philosophy. The founder is pushing for a pilot trough feeding program to serve as a proof of concept for the plan and has opened a volunteer sign-up list. “It’s possible that the school isn’t ready for this revolution, but I truly believe troughs are the future of consumption.” "
    },
    {
      "id": 3,
      "blogCategory": "News",
      "blogTitle": "Mike Pence anounce visit to SPA during X-Period next Thursday",
      "slug": "",
      "postedOn": "March 2, 2022",
      "author": "Marecchia Staff",
      "blogImage": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/17/V20200729DS-0340_%2850167142363%29.jpg/1200px-V20200729DS-0340_%2850167142363%29.jpg?20200923175055",
      "imageCredit": "Wikimedia Commons, Fair Use Image",
      "blogText": "Last week, after overwhelming requests from the student body former Vice President Mike Pence has announced his intention to visit SPA next Thursday. Pence will be speaking on the Ukraine-Russia crisis and also his role in undermining democracy throughout his time in the White House. One student the Marecchia spoke to said, “the amount of support from the student body is incredible. We love Mike Pence as an institution, so it's really cool that he’s finally agreed to come speak to us.” Students are encouraged to participate in a Q&A after his talk but the Pence team has discouraged any questions “about to the election or honestly anything political or anything to do with how he refers to his wife as ‘Mother,’” as all of these are sore topics for him. Interested students are encouraged to spread election misinformation around campus to help create a welcoming environment for Pence and his team."
    }
  ]
}
